package de.telran.javaPro.lections.lesson_24_04_15;

public class MethodWithLabmda {
    /**
     * 2. Написать метод, который на вход принимает два массива одинакового размера типа Integer и функцию.
     * Метод возвращает массив, в котором хранятся результаты попарных вычислений согласно переданной функции.
     */

    public static void main(String[] args) {
//        Integer[] array1 = {1,2,3,4,5};
//        Integer[] array2 = {6,7,8,9,10};
//        Integer result = process(array1,array2 , (i,j) -> i + j);
//        System.out.println(Arrays.toString(result));
//
//    }
//
//    public static  Integer[] process(Integer[] array1, Integer[] array2, BinaryOperator<Integer> action){
//        if ( array1.length != array2.length) return null;
//        Integer[] result = new Integer[array1.length];
//
//        for (int i = 0; i < array1.length; i++) {
//            Integer r =
        }

    }

