package de.telran.javaPro.lections.lesson_24_04_11.statistik;


import java.util.Arrays;
import java.util.HashMap;
import java.util.Map;

public class Main {
    public static void main(String[] args) {

        /**
         * Имеется некоторый текст. Составить словарь используемых в нем слов с частотой их употребления.
         * Отсортировать словарь по частоте встречаемости слов (по убыванию).
         */
        String text = "Ой у лузі червона калина похилилася\n" +
                "Чогось наша славна Україна зажурилася\n" +
                "А ми тую червону калину підіймемо\n" +
                "А ми нашу славну Україну\n" +
                "Гей, гей, розвеселимо!\n" +
                "А ми тую червону калину підіймемо\n" +
                "А ми нашу славну Україну\n" +
                "Гей, гей, розвеселимо!\n" +
                "Гей, розвеселимо Україну\n" +
                "Гей, розвеселимо, розвеселимо!\n" +
                "Гей, розвеселимо Україну\n" +
                "Гей, розвеселимо, розвеселимо!\n" +
                "Марширують наші добровольці у кривавий тан\n" +
                "Визволяти братів-українців з московських кайдан\n" +
                "А ми тую червону калину підіймемо\n" +
                "А ми нашу славну Україну\n" +
                "Гей, гей, розвеселимо!\n" +
                "А ми тую червону калину підіймемо\n" +
                "А ми нашу славну Україну\n" +
                "Гей, гей, розвеселимо!\n" +
                "Гей, розвеселимо Україну\n" +
                "Гей, розвеселимо, розвеселимо!\n" +
                "Гей, розвеселимо Україну\n" +
                "Гей, розвеселимо, розвеселимо!\n" +
                "Не хилися, червона калино маєш білий цвіт\n" +
                "Не журися, славна Україно маєш вільний рід\n" +
                "А ми тую червону калину підіймемо\n" +
                "А ми нашу славну Україну\n" +
                "Гей, гей, розвеселимо!\n" +
                "А ми тую червону калину підіймемо\n" +
                "А ми нашу славну Україну\n" +
                "Гей, гей, розвеселимо!\n" +
                "Гей, розвеселимо Україну\n" +
                "Гей, розвеселимо, розвеселимо!\n" +
                "Гей, розвеселимо Україну\n" +
                "Гей, розвеселимо, розвеселимо!\n" +
                "Гей, розвеселимо Україну\n" +
                "Гей, розвеселимо, розвеселимо!\n" +
                "Гей, розвеселимо Україну\n" +
                "Гей, розвеселимо, розвеселимо!";
        String[] words = text.split("\\s+");

        // Вывод содержимого массива слов
        System.out.println(Arrays.toString(words));


        Map<String, Integer> countWords = new HashMap<>();

        for (String word : words) {
            if (!word.isEmpty()){
                if (countWords.containsKey(word)) {
                    countWords.put(word, countWords.get(word) + 1);
                }else countWords.put(word,1);
            }
        }

        for (Map.Entry<String, Integer> entry : countWords.entrySet()) {
            System.out.println(entry.getKey() + " : " + entry.getValue());
        }


    }
}



