package de.telran.new_group.lesson_24_03_11;

import java.util.ArrayList;
import java.util.Iterator;
import java.util.List;

public class ListExample {
    public static void main(String[] args) {
        List<Integer> integerList = new ArrayList<>(List.of(1,2,3,4,5,6,7,9,10,11,23,30));
        Iterator<Integer> iterator = integerList.iterator();

//        while (iterator.hasNext()) {
//            Integer element = iterator.next();
//            int num = iterator.next;
//            if (element % 2 != 0) {
//                System.out.println(num);
//            }
//
//            iterator = integerList.iterator(){
//
//            }
    }


    }

//    1. Дан список из числовых данных.
//С помощью итератора:
//a). Напечатать только четные числа из списка.
//b). Удалить из списка все числа, заканчивающиеся на 0.
//c). Составить список квадратов чисел.





